---
kind: property
id: P:Autodesk.Revit.DB.FabricationItemFolder.Name
source: html/6a827b9f-fbde-2334-4f65-be580c28f582.htm
---
# Autodesk.Revit.DB.FabricationItemFolder.Name Property

The item folder's name.

## Syntax (C#)
```csharp
public string Name { get; }
```